Hi @mdavid01 👋 ,

thanks for raising the issue related to the SecretsManager resources.

I was going through the details you provided. If I understood you right, you would like to use `aws_secretsmanager_secret` and `aws_secretsmanager_secret_version` for managing a database user password . The actual password should be passed `aws_secretsmanager_secret_version` as variable from the outside, here using TF_VAR.

Next, I tried to come up with a minimal code for testing the behavior. It uses Terraform AWS provider v4.67.0, defines a variable `DB_PASSWORD` (I commented out the `default` to avoid surprises)

```hcl
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "4.67.0"
    }
  }
  required_version = "1.11.2"
}

variable "DB_PASSWORD" {
  type        = string
  description = "The password for the database."
  #default = ""
}
provider "aws" {
  region = "eu-central-1"
}

resource "aws_secretsmanager_secret" "example" {
  name = "example-secret"
}
resource "aws_secretsmanager_secret_version" "example" {
  secret_id     = aws_secretsmanager_secret.example.id
  secret_string =  var.DB_PASSWORD
}
```

This configuration I rolled out into an AWS account without an issue

```shell
❯ export TF_VAR_DB_PASSWORD="MyPassw0rd"
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.example will be created
  + resource "aws_secretsmanager_secret" "example" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "example-secret-abs"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica (known after apply)

      + rotation_rules (known after apply)
    }

  # aws_secretsmanager_secret_version.example will be created
  + resource "aws_secretsmanager_secret_version" "example" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_secretsmanager_secret.example: Creating...
aws_secretsmanager_secret.example: Creation complete after 0s [id=arn:aws:secretsmanager:eu-central-1:redacted:secret:example-secret-abs-4pKRqI]
aws_secretsmanager_secret_version.example: Creating...
aws_secretsmanager_secret_version.example: Creation complete after 1s [id=arn:aws:secretsmanager:eu-central-1:redacted:secret:example-secret-abs-4pKRqI|55F903F5-E19B-4171-897F-2B6BE82D9662]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```


Testing a bit more I noticed that having the `DB_PASSWORD` defined as empty string (`""`) and trying to create the secret version with this empty string gives the error message you reported.


```hcl
❯ export TF_VAR_DB_PASSWORD=""
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.example will be created
  + resource "aws_secretsmanager_secret" "example" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "example-secret-123456"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica (known after apply)

      + rotation_rules (known after apply)
    }

  # aws_secretsmanager_secret_version.example will be created
  + resource "aws_secretsmanager_secret_version" "example" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_secretsmanager_secret.example: Creating...
aws_secretsmanager_secret.example: Creation complete after 0s [id=arn:aws:secretsmanager:eu-central-1:redacted:secret:example-secret-123456-33SwOU]
aws_secretsmanager_secret_version.example: Creating...
╷
│ Error: putting Secrets Manager Secret value: InvalidRequestException: You must provide either SecretString or SecretBinary.
│ 
│   with aws_secretsmanager_secret_version.example,
│   on main.tf line 23, in resource "aws_secretsmanager_secret_version" "example":
│   23: resource "aws_secretsmanager_secret_version" "example" {
│ 
```

One recommendation for further debugging the issue in your set up would be to remove the default value from the `DB_PASSWORD`. 